OdDAI.InstanceIterator.id
\details
Retrieves the identifier of the iterator object.
\returns Returns the iterator's identifier.

OdDAI.InstanceIterator.step
\details
Moves to the next instance in the list.

OdDAI.InstanceIterator.done
\details
Retrieves whether the end of the instance list is reached.
\returns Returns true if the end of the instance list is reached; otherwise the method returns false.

OdDAI.InstanceIterator.Dispose
\details
Destroys the iterator object.

OdDAI.InstanceIterator
\details
An abstract class that provides the interface of an iterator through entities of the model.
An iterator allows you to get sequential access to entities that are contained in any collection.